; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	image2 - mode
	spectrograph1 - mode
	image3 - mode
	image0 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	Star1 - direction
	Star4 - direction
	Star0 - direction
	Star3 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star15)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument3 spectrograph1)
	(supports instrument3 image2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite2 Planet14)
	(have_image Phenomenon6 spectrograph1)
	(have_image Star7 image3)
	(have_image Phenomenon8 spectrograph1)
	(have_image Planet9 image0)
	(have_image Star10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 image2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 image3)
	(have_image Star15 image0)
))

)

; plan
1. (turn_to satellite3 star3 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star3)
   goals met: 0 of 11
2. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite3 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite3 phenomenon13 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 phenomenon13)
   goals met: 0 of 11
5. (take_image satellite3 phenomenon13 instrument3 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 1 of 11
6. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   goals met: 1 of 11
7. (turn_to satellite2 planet14 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet14)
   goals met: 2 of 11
8. (turn_to satellite0 star1 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star1)
   goals met: 2 of 11
9. (take_image satellite3 phenomenon12 instrument3 image2)
   added: (have_image phenomenon12 image2)
   goals met: 3 of 11
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 11
11. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 3 of 11
12. (turn_to satellite0 planet14 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet14)
   goals met: 3 of 11
13. (take_image satellite0 planet14 instrument0 image3)
   added: (have_image planet14 image3)
   goals met: 4 of 11
14. (turn_to satellite0 star7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star7)
   goals met: 4 of 11
15. (take_image satellite0 star7 instrument0 image3)
   added: (have_image star7 image3)
   goals met: 5 of 11
16. (turn_to satellite3 phenomenon6 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon6)
   goals met: 5 of 11
17. (take_image satellite3 phenomenon6 instrument3 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 6 of 11
18. (turn_to satellite3 phenomenon8 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 phenomenon8)
   goals met: 6 of 11
19. (take_image satellite3 phenomenon8 instrument3 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 7 of 11
20. (turn_to satellite3 planet11 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet11)
   goals met: 7 of 11
21. (take_image satellite3 planet11 instrument3 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 8 of 11
22. (turn_to satellite3 planet9 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet9)
   goals met: 8 of 11
23. (take_image satellite3 planet9 instrument3 image0)
   added: (have_image planet9 image0)
   goals met: 9 of 11
24. (turn_to satellite3 star10 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star10)
   goals met: 9 of 11
25. (take_image satellite3 star10 instrument3 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 10 of 11
26. (turn_to satellite3 star15 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star15)
   goals met: 10 of 11
27. (take_image satellite3 star15 instrument3 image0)
   added: (have_image star15 image0)
   goals met: 11 of 11
